observador/app/Controllers/AdminController.php

    public function index()
    {
        $usuarios = $this->usuarioModel
            ->orderBy('nombre')
            ->findAll();

        $auditoria = $this->auditoriaModel
            ->select('auditoria_archivos.*, usuarios.nombre')
            ->join('usuarios','usuarios.id_usuario=auditoria_archivos.id_usuario')
            ->orderBy('fecha','DESC')
            ->limit(100)
            ->find();

        $backups = $this->backupModel
            ->orderBy('fecha','DESC')
            ->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `nombre`
SELECT `auditoria_archivos`.*, `usuarios`.`nombre`
FROM `auditoria_archivos`
JOIN `usuarios` ON `usuarios`.`id_usuario`=`auditoria_archivos`.`id_usuario`
ORDER BY `fecha` DESC
 LIMIT 100
SELECT *
FROM `backups`
ORDER BY `fecha` DESC