observador/app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `correo` = 'admin@admin.com'
 LIMIT 1
---
    public function validar()
    {
        $correo = $this->request->getPost('correo');
        $password = $this->request->getPost('password');

        $usuarioModel = new UsuarioModel();

        $usuario = $usuarioModel
                    ->where('correo',$correo)
                    ->first();